In [1]:
import pandas as pd
import sqlite3

In [29]:
df = pd.read_excel('lista plac payroll.xlsx')

In [30]:
df.head(3)

,Nazwisko_imię,wynagrodzenie_netto,podatek,ubezpieczenie,wynagrodzenie_brutto,stanowisko,dzial
0,Bochenek Elżbieta,1752.41,0.19,0.12,2295.66,szwaczka,produkcja
1,Czarnecka Mirosława,1455.00,0.19,0.12,1906.05,szwaczka,produkcja
2,Gozdan Hanna,1752.41,0.19,0.12,2295.66,sekretarka,biuro

In [34]:
df.groupby('dzial').mean()

           wynagrodzenie_netto  podatek  ubezpieczenie  wynagrodzenie_brutto
dzial
biuro              2434.715000     0.19           0.12           3189.477500
produkcja          1735.536316     0.19           0.12           2273.553684
warsztat           1591.110000     0.19           0.12           2084.355000

In [32]:
con = sqlite3.connect('data/wyniki.db')
cur = con.cursor()
df.to_sql('place', con, if_exists='replace')
con.close()

In [36]:
con = sqlite3.connect('data/wyniki.db')
dd = pd.read_sql_query("SELECT dzial, avg(wynagrodzenie_brutto) AS brutto from place GROUP BY dzial", con)
con.close()
dd

       dzial       brutto
0      biuro  3189.477500
1  produkcja  2273.553684
2   warsztat  2084.355000